tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/constant/topAir/RASProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          RASProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel kEpsilon;

//turbulence      on;
turbulence      off;

laminarCoeffs
{
}

kEpsilonCoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    C3               0.85;
    alphah           1;
    alphak           1;
    alphaEps         0.76923;
}

RNGkEpsilonCoeffs
{
    Cmu              0.0845;
    C1               1.42;
    C2               1.68;
    C3               -0.33;
    alphah           1;
    alphak           1.39;
    alphaEps         1.39;
    eta0             4.38;
    beta             0.012;
}

LaunderSharmaKECoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    C3               -0.33;
    alphah           1;
    alphak           1;
    alphaEps         0.76923;
}

LRRCoeffs
{
    Cmu              0.09;
    Clrr1            1.8;
    Clrr2            0.6;
    C1               1.44;
    C2               1.92;
    alphah           1;
    Cs               0.25;
    Ceps             0.15;
    alphaR           1;
    alphaEps         0.76923;
}

LaunderGibsonRSTMCoeffs
{
    Cmu              0.09;
    Clg1             1.8;
    Clg2             0.6;
    C1               1.44;
    C2               1.92;
    alphah           1;
    C1Ref            0.5;
    C2Ref            0.3;
    Cs               0.25;
    Ceps             0.15;
    alphaR           1;
    alphaEps         0.76923;
}

wallFunctionCoeffs
{
    kappa            0.4187;
    E                9;
}


// ************************************************************************* //
